# Задача 1
# Есть список a = [1, 1, 2, 3, 5, 8, 13, 21, 34, 55, 89].

# Выведите все элементы, которые меньше 5.

# a = [1, 1, 2, 3, 4, 4, 4, 5, 8, 13, 21, 34, 55, 89]
# for i in a:
#     if i < 5:
#         print([i])
        
        
# print(list(filter(lambda i: i < 5, a)))

# print(*[i for i in a if i < 5])

# ???????????????????????????????????????????????????????????????????????????????????

# Задача 2
# Даны списки:

# a = [1, 1, 2, 3, 5, 8, 13, 21, 34, 55, 89];

# b = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13].

# Нужно вернуть список, который состоит из элементов, общих для этих двух списков.
    
    
# a = [1, 1, 2, 3, 5, 8, 13, 21, 34, 55, 89]

# b = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13]

# result = list(filter(lambda elem: elem in b, a))
# print(result)

# result = [elem for elem in a if elem in b]
# print(result)

# result = list(set(a) & set(b))
# print(result)

# ???????????????????????????????????????????????????????????????????????????????????

# Задача 3
# Отсортируйте словарь по значению в порядке возрастания и убывания.


# import operator 
# d = {1: 2, 3: 4, 4: 3, 2: 1, 0: 0}

# result = dict(sorted(d.items(), key=operator.itemgetter(1)))
# print(result)

# result = dict(sorted(d.items(), key=operator.itemgetter(1), reverse=True))
# print(result)

# ???????????????????????????????????????????????????????????????????????????????????


# Задача 4
# Напишите программу для слияния нескольких словарей в один.

# d = {1: 2, 3: 4, 4: 3, 2: 1, 0: 0}

# a = {42: 5, 43: 6, 44: 7, 45: 8, 46: 0}

# result = {}
# for dc in (a, d):

#     result.update(dc)
# print(result)



# Задача 5
# Найдите три ключа с самыми высокими значениями в словаре my_dict = {'a':500, 'b':5874, 'c': 560,'d':400, 'e':5874, 'f': 20}.


my_dict = {'a':500, 'b':5874, 'c': 560,'d':400, 'e':5874, 'f': 20}
num = 0
for key in my_dict:
    for i in key:
        